app/Controllers/AdminController.php

    public function saveCourse()
    {
        $data = [
            'course_name' => $this->request->getPost('course_name'),
            'credits' => $this->request->getPost('credits')
        ];

        if (empty($data['course_name']) || empty($data['credits'])) {
            return redirect()->back()->with('error', 'Semua field harus diisi.');
        }

        $this->courseModel->insert($data);
---
INSERT INTO `courses` (`course_name`, `credits`) VALUES ('Pemrograman Berorientasi Objek Praktik', '3')