app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'student'
 LIMIT 1
---
    public function process()
{
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $model = new \App\Models\UserModel();
    $user = $model->where('email', $email)->first();