app/Controllers/MahasiswaController.php

    public function index()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Kelola Mahasiswa',
            'mahasiswa' => $this->mahasiswaModel->findAll()
---
SELECT *
FROM `mahasiswa`

    public function store()
    {
        //dd('store masuk', $this->request->getPost());

        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $rules = [
            'nim' => 'required|min_length[10]|max_length[10]|is_unique[mahasiswa.nim]',
            'nama_lengkap' => 'required|min_length[3]',
            'jenis_kelamin' => 'required|in_list[L,P]',
            'tanggal_lahir' => 'required|valid_date',
            'umur' => 'required|integer|greater_than[0]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/mahasiswa/create')->withInput()->with('validation', $this->validator);
        }

        $model = new MahasiswaModel();
        $data = [
            'nim' => $this->request->getPost('nim'),
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'tanggal_lahir' => $this->request->getPost('tanggal_lahir'),
            'umur' => $this->request->getPost('umur')
        ];

        $model->insert($data);

        $this->mahasiswaModel->save($data);
---
INSERT INTO `mahasiswa` (`nim`, `nama_lengkap`, `jenis_kelamin`, `tanggal_lahir`, `umur`) VALUES ('2415110015', 'Malik', 'L', '2002-02-02', '23')
UPDATE `mahasiswa` SET `nim` = '2415110015', `nama_lengkap` = 'Malik', `jenis_kelamin` = 'L', `tanggal_lahir` = '2002-02-02', `umur` = '23'
WHERE `mahasiswa`.`nim` IN ('2415110015')