app/Controllers/StudentController.php

    public function enrollCourses()
    {
        $userId = $this->session->get('user_id');
        $student = $this->studentModel->where('user_id', $userId)->first();
---
SELECT *
FROM `students`
WHERE `user_id` = '3'
 LIMIT 1

    public function storeEnroll()
    {
        $courseIds = $this->request->getPost('course_id');
        $userId = $this->session->get('user_id');
        $student = $this->studentModel->where('user_id', $userId)->first();
---
SELECT *
FROM `students`
WHERE `user_id` = '3'
 LIMIT 1

    public function deleteEnrolledCourse($courseId)
{
    $userId = $this->session->get('user_id');
    $student = $this->studentModel->where('user_id', $userId)->first();

    if (!$student) {
        return redirect()->back()->with('error', 'Data mahasiswa tidak ditemukan.');
    }

    $this->takeModel->where('student_id', $student['student_id'])
                    ->where('course_id', $courseId)
                    ->delete();
---
SELECT *
FROM `students`
WHERE `user_id` = '3'
 LIMIT 1
DELETE FROM `takes`
WHERE `student_id` = '1'
AND `course_id` = '1'