app/Models/CourseModel.php

    public function getAllCourses()
    {
        return $this->findAll();
---
SELECT *
FROM `courses`