app/Models/StudentModel.php

SELECT *
FROM `students`
WHERE `user_id` = '3'
 LIMIT 1
---
    public function getStudentByUserId($userId)
    {
        return $this->where('user_id', $userId)->first();