app/Models/TakeModel.php

    public function getEnrolledCourses($studentId)
    {
        $builder = $this->db->table('takes');
        $builder->select('courses.course_id, courses.course_name, courses.credits, takes.enroll_date'); // Pastikan kolom ini ada
        $builder->join('courses', 'courses.course_id = takes.course_id', 'left'); // Gunakan LEFT JOIN untuk debug
        $builder->where('takes.student_id', $studentId);
        $result = $builder->get()->getResultArray();
---
SELECT `courses`.`course_id`, `courses`.`course_name`, `courses`.`credits`, `takes`.`enroll_date`
FROM `takes`
LEFT JOIN `courses` ON `courses`.`course_id` = `takes`.`course_id`
WHERE `takes`.`student_id` = '1'

    public function getAllCourses()
    {
        $courseModel = new \App\Models\CourseModel();
        return $courseModel->findAll();
---
SELECT *
FROM `courses`

    public function enrollCourse($studentId, $courseId)
    {
        $existing = $this->where('student_id', $studentId)
                         ->where('course_id', $courseId)
                         ->first();
        if ($existing) {
            return false;
        }

        $data = [
            'student_id' => $studentId,
            'course_id' => $courseId,
            'enroll_date' => date('Y-m-d')
        ];
        return $this->insert($data);
---
SELECT *
FROM `takes`
WHERE `student_id` = '1'
AND `course_id` = '3'
 LIMIT 1
INSERT INTO `takes` (`student_id`, `course_id`, `enroll_date`) VALUES ('1', '4', '2025-09-23')